title: New permissions granted to service principals
id: 
status: experimental
description: Detects New permissions granted to service principals
references:
    - https://techcommunity.microsoft.com/t5/azure-active-directory-identity/azure-ad-workbook-to-help-you-assess-solorigate-risk/ba-p/2010718 @Alex_t_weinert
    - https://docs.microsoft.com/en-us/azure/active-directory/develop/v2-permissions-and-consent
    - https://attack.mitre.org/techniques/T1078/004/
tags:
    - attack.Valid Accounts
    - attack.T1078.004
author: '@NoLogsNoCrime'
date: 2020/12/23
modified: 
logsource:
    product: Cloud
    service: Azure
detection:
    selection:
        AzureActiveDirectory
        Message|contains:
            - 'Add app role assignment*'
    condition: selection
fields:
    - Operation [Add app role assignment to service principal, Add app role assignment grant to user]
    - TargetID
    - ActorID
    - ObjectId
falsepositives:
    - Can be noisy. Admins should investigate any instances of excessive high permissions being granted, including, but not limited to, Exchange Online, Microsoft Graph and Azure AD Graph.
level: medium