title: Directory role and group membership updates for service principals
id: 
status: experimental
description: Detects directory role and group membership updates for service principals
references:
    - https://techcommunity.microsoft.com/t5/azure-active-directory-identity/azure-ad-workbook-to-help-you-assess-solorigate-risk/ba-p/2010718 @Alex_t_weinert
    - https://attack.mitre.org/techniques/T1078/004/
tags:
    - attack.Valid Accounts
    - attack.T1078.004
author: '@NoLogsNoCrime'
date: 2020/12/23
modified: 
logsource:
    product: Cloud
    service: Azure
detection:
    selection:
        AzureActiveDirectory
        Message|contains:
            - 'Add member to role*'
    condition: selection
fields:
    - Operation
    - TargetID
    - ActorID
    - ObjectId
falsepositives:
    - Can be noisy. Admins should review for any additions to high privilege roles and groups.
level: medium