title: Add service principal credentials
id: 
status: experimental
description: Detects User added credentials to Service Principals
references:
    - https://techcommunity.microsoft.com/t5/azure-active-directory-identity/azure-ad-workbook-to-help-you-assess-solorigate-risk/ba-p/2010718  @Alex_t_weinert
    - https://docs.microsoft.com/en-us/cli/azure/create-an-azure-service-principal-azure-cli?toc=%2Fazure%2Fazure-resource-manager%2Ftoc.json&view=azure-cli-latest
    - https://attack.mitre.org/techniques/T1098/001/
tags:
    - attack.Account Manipulation
    - attack.T1098.001
author: '@NoLogsNoCrime'
date: 2020/12/23
modified: 
logsource:
    product: Cloud
    service: Azure
detection:
    selection:
        AzureActiveDirectory
        Message|contains:
            - 'add service principal credentials*'
    condition: selection
fields:
    - Operation
    - TargetID
    - ActorID
falsepositives:
    - Legitimate administration work
level: medium
