title: Azure AD modifications to refresh tokens
id: 
status: experimental
description: Detects Azure AD STS refresh token modifications by service principals and applications other than DirectorySync
references:
    - https://techcommunity.microsoft.com/t5/azure-active-directory-identity/azure-ad-workbook-to-help-you-assess-solorigate-risk/ba-p/2010718 @Alex_t_weinert
    - https://docs.microsoft.com/en-us/azure/active-directory/develop/active-directory-configurable-token-lifetimes#refresh-tokens 
    - https://attack.mitre.org/techniques/T1078/004/
tags:
    - attack.Valid Accounts
    - attack.T1078.004
author: '@NoLogsNoCrime'
date: 2020/12/23
modified: 
logsource:
    product: Cloud
    service: Azure
detection:
    selection:
        AzureActiveDirectory
        Message|contains:
            - 'StsRefreshTokensValidFrom'
    condition: selection
fields:
    - ModifiedProperties ["StsRefreshTokensValidFrom":{"NewValue":"[]","OldValue":"[]"]
    - Operation [Add user, Update StsRefreshTokensValidFrom Timestamp, Update user]
    - TargetID
    - ActorID
    - ObjectId
falsepositives:
    - Can be noisy. Admins should check new token validation time period with high values and investigate whether this was a legitimate change or an attempt to gain persistence by the attacker.
level: medium